app/controllers/creatures_controller.rb

  def new
    @creature = Creature.new()
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def edit
    @creature = Creature.find_by_id(params[:id])
    @tags = Tag.all
---
SELECT  "creatures".* FROM "creatures"  WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags"

  def update
    @creature = Creature.find_by_id(params[:id])
    @creature.update(creature_params)
    @creature.save

    @creature.tags.clear
    tags = params[:creature][:tag_ids]
    tags.each do |tag_id|
      @creature.tags << Tag.find(tag_id) unless tag_id.blank?
---
SELECT  "creatures".* FROM "creatures"  WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "desc" = ?, "name" = ?, "updated_at" = ? WHERE "creatures"."id" = 1  [["desc", "Cuddly and friendly"], ["name", "Dog"], ["updated_at", "2015-01-12 02:21:35.144277"]]
SELECT "tags".* FROM "tags" INNER JOIN "creatures_tags" ON "tags"."id" = "creatures_tags"."tag_id" WHERE "creatures_tags"."creature_id" = ?  [["creature_id", 3]]
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 3]]

  def show
    @creature = Creature.find_by_id(params[:id])

    @tags = @creature.tags.map do |tag|
---
SELECT  "creatures".* FROM "creatures"  WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "creatures_tags" ON "tags"."id" = "creatures_tags"."tag_id" WHERE "creatures_tags"."creature_id" = ?  [["creature_id", 3]]

  def create
    @creature = Creature.create(creature_params)
    @tags = Tag.all
    if @creature.errors.any?
      render :new
    else
      @creature.tags.clear
      tags = params[:creature][:tag_ids]

      tags.each do |tag_id|
        @creature.tags << Tag.find(tag_id) unless tag_id.blank?
---
INSERT INTO "creatures" ("created_at", "desc", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-12 01:45:46.062633"], ["desc", "slimy"], ["name", "Slug"], ["updated_at", "2015-01-12 01:45:46.062633"]]
SELECT "tags".* FROM "tags"
SELECT "tags".* FROM "tags" INNER JOIN "creatures_tags" ON "tags"."id" = "creatures_tags"."tag_id" WHERE "creatures_tags"."creature_id" = ?  [["creature_id", 10]]
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 5]]

  def destroy
    @creature = Creature.find_by_id(params[:id])
    @creature.destroy
---
SELECT  "creatures".* FROM "creatures"  WHERE "creatures"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 2]]

  def tag
    tag = Tag.find_by_name(params[:tag])
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."name" = 'cool' LIMIT 1