app/controllers/tags_controller.rb

  def show
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"