app/controllers/tags_controller.rb

  def create
    @tag = Tag.all
    @tag = Tag.create(tags_params)
---
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-15 18:53:13.595941"], ["name", ""], ["updated_at", "2015-01-15 18:53:13.595941"]]